let data =
{
  "songs_detail": [
    {
      "name": "夜に駆ける",
      "view": "254,231,115"
    },
    {
      "name": "あの夢をなぞって",
      "view": "40,611,404"
    },
    {
      "name": "ハルジオン",
      "view": "63,346,588"
    },
    {
      "name": "たぶん",
      "view": "43,809,145"
    },
    {
      "name": "群青",
      "view": "60,421,439"
    },
    {
      "name": "ハルカ",
      "view": "29,815,806"
    },
    {
      "name": "怪物",
      "view": "145,580,521"
    },
    {
      "name": "優しい彗星",
      "view": "21,538,588"
    },
    {
      "name": "もう少しだけ",
      "view": "21,478,996"
    },
    {
      "name": "アンコール",
      "view": "39,238,248"
    },
    {
      "name": "三原色",
      "view": "22,551,402"
    }
  ]
}